# -*- coding: utf-8 -*-
"""
Created on Sat Jun  1 11:53:38 2019

@author: gzp
"""

from sklearn.neighbors import KNeighborsRegressor
import pandas as pd 
import sys
import os
def pedict_price(items):
    
    #F:\javaPractice\ycThree\pythonSpyder\pythonHomeWork\projectMenu
    #F:\javaPractice\ycThree\pythonSpyder\menuPrice.txt
    #filename=os.getcwd()+os.path.sep+'menuPrice.txt'
    path=""
    datas=pd.read_csv('menuPrice.txt',sep='\t',names=['Hun','Su','PeiLiao','Price'])
    new=pd.DataFrame(items,index=[0])
    datas=datas.append(new,ignore_index=True)

    y_train=datas['Price'][0:-1].values
    x_train=datas.drop( ['Price'] ,axis=1).values[0:-1]
    #print(features,'***************')
    x_test=[datas.drop(['Price'] ,axis=1).values[-1]]
    uni_knr=KNeighborsRegressor( weights='uniform' )
    # print(x_train)
    # print(y_train)
    uni_knr.fit( x_train,y_train )
    uni_knr_y_predict=uni_knr.predict( x_test )
    return uni_knr_y_predict

if __name__=='__main__':

    row = ['猪油', '鲜土鸡', '肉末', '五花肉', '肥肉', '龙骨', '牛奶', '湖南腊肉', '虾油', '鱼汤', '鱿鱼须', '肉', '鱼胶粉', '熟咸鸭蛋', '梅肉', '鲈鱼', '虾仁',
           '虾皮', '腊肉肠', '文鱼', '鸡精', '新鲜鱿鱼', '带皮五花肉', '清鸡高汤', '猪肉糜', '大虾', '熟猪肚', '鸡翅中', '咸鸭蛋黄', '走地童子鸡', '猪瘦肉', '鸡粉',
           '猪肘', '肉松', '鸡精：', '猪精肉', '花鲶鱼头', '鸡翅', '草鱼头', '鱼露', '鸡杂', '咸肉', '鸡腿', '猪腿肉', '牛肉粉：', '猪肘子', '鸭肝', '明虾',
           '肉燕', '脆肉皖', '鸡蛋：', '牛杂', '炖肉料：', '酸菜鱼调料包', '鸭珍', '猪肉', '鸡爪', '牛肉', '虾', '土鸡蛋', '肉糜', '羊杂碎', '猪肉末', '牛肉片',
           '熟排骨', '鸡蛋', '鸭胗', '蒸肉粉', '五花肉馅儿', '猪前夹肉', '肉丝', '小龙虾', '猪肝', '杂菜', '鱼头', '风干鱼', '碎肉', '猪油（白皮）', '骨头汤：',
           '巴沙鱼', '熟猪心', '鸡翅根', '臭鳜鱼', '牛里脊', '猪肋排', '鲢鱼头', '基围虾', '鲜虾', '鱿鱼', '鸡粉：', '猪里脊', '蒸鱼豉油', '鱼骨', '猪大骨', '鸭子',
           '盐焗鸡粉', '龙虾', '兔肉', '小鲍鱼', '牛奶：', '鸡蛋液', '鸭', '鸡蛋清', '黑鱼片', '鸡', '猪手', '蒸鱼豉油：', '五花肉丁：', '鸭血', '肉桂粉', '猪蹄',
           '桂鱼', '羊头：', '肉桂粉：', '圆素鸡', '猪油（红皮）', '鸭蛋', '鲜肉', '牡蛎肉', '三黄鸡', '鸡蛋面', '瘦肉', '鲫鱼', '小老鸡', '草鱼', '鱼尾', '田鸡',
           '里脊肉', '鸡中翅', '肉碎', '肉蔻', '小鱿鱼干', '肉馅', '排骨', '猪肉馅', '腊肉', '猪油（油酥）', '鸡肉', '羊骨', '鸡脯肉', '鸡屎藤粉', '猪油：',
           '金龙鱼优+活性发酵空心挂面', '净膛三黄鸡', '蒜肉', '鸡膀根', '肉腐', '鱼杂', '猪大骨棒', '梅花肉', '肉饼', '牛肉馅', '鸭腿', '鸭肠', '虾米', '猪里脊肉',
           '肉骨茶调料', '母鸡', '猪五花肉', '鲜虾仁', '小龙虾：', '鸡蛋饺子馅', '羊肉', '猪油渣', '肉松：', '新鲜土鸡', '石蛙', '猪肚', '午餐肉', '鸡胸肉', '达州肉圆子',
           '虾肉']  # 肉类
    vege = ['豌豆粉', '黑胡椒', '白蔻', '云吞皮', '胡萝卜饺子馅', '鲜面条', '糖粉：', '梅干菜：', '杏仁片', '红杭椒', '矿泉水：', '酒酿', '食用油：', '五香粉',
            '熟黄豆粉', '熟白芝麻', '剁椒', '豆腐乳', '香葱碎：', '老萝卜干', '二锅头酒', '绿豆芽', '平菇', '三生川干辣椒', '料酒', '海天黄豆酱', '蔬菜', '温水：',
            '菜子油：', '新鲜红辣椒', '花椒：', '红甜椒', '玫瑰腐乳', '油条', '莴苣', '生菜', '切面', '大红辣椒', '豌豆', '绿豆粉', '水面', '蔬菜：', '精盐',
            '馄饨皮', '蒜叶：', '小麦淀粉', '三生川农家花椒', '淡奶油', '月亮树，苹果', '高梁米', '食盐', '葱姜水', '温水（不高于35度）', '白葡萄酒', '油辣子：', '冬笋',
            '野苋菜', '辣根', '熟花生油：', '熟花生碎', '葱末：', '梅干菜', '紫苏叶', '雪里蕻', '蔓越莓', '姜末', '绿杭椒：', '香酥黄豆', '海米', '豌豆尖', '红糟',
            '酸菜', '味精', '麻椒', '食用碱', '奶粉', '艾叶', '胡椒', '葱姜', '韭黄', '桂花蜜：', '中筋面粉（白皮）', '藕粉', '韭菜', '山茶油：', '桂皮', '香油：',
            '海蛎', '中筋面', '黑芝麻花生馅：', '马蹄', '麦芽糖浆', '黑加仑', '干桂花：', '蛋黄', '大海螺', '黄油', '草果：', '花生米', '生姜：', '红油辣椒：',
            '大白菜饺子馅', '腐乳', '绿甜椒', '姜：', '韭菜花', '本仔糕分', '面条', '葱姜蒜', '蔓越莓干：', '蒜泥', '白芝麻：', '扇贝丁', '山药', '中粉', '红辣椒',
            '蒜米', '豆腐干', '肠粉粉', '海盐：', '辣椒面', '熟花生仁', '小麦澄粉', '沙茶酱', '芝麻油：', '脱皮豌豆', '红糖水', '永川豆豉', '花椒', '南瓜汤汁',
            '老盐水：', '生菜：', '红薯泥', '豆豉酱', '白胡椒粉', '桔饼', '干淀粉', '胡椒粉：', '树椒', '臭乳腐', '西兰花：', '红椒丝', '面酱', '豆芽', '黄豆粉：',
            '大蒜粒', '蚕豆豆瓣', '生抽：', '低筋面粉', '干红椒', '普宁豆干', '椰蓉：', '八角：', '新鲜兔丁', '高度白酒 ', '辣椒油：', '土豆淀粉', '老面', '香葱末',
            '熟黑芝麻', '粿条', '食盐：', '大蒜叶', '油炸青豌豆', '郫县豆瓣', '松子：', '山楂', '粘米粉', '姜末：', '葱：', '豆腐串', '豆酱', '干黄酱', '葱丝',
            '子姜', '小红椒：', '青辣椒', '无：', '粉丝', '香菇', '花椒面：', '板栗', '盐：', '澄粉', '水淀粉：', '大米', '培根', '花生：', '萝卜干：', '老姜：',
            '黑芝麻：', '德庄火锅底料', '干辣椒', '红薯干粉条', '米糠油', '葱花：', '龙口粉丝', '调和油：', '纯净水：', '甜面酱：', '黄酒：', '腊肠', '自制红豆沙适量',
            '小辣椒', '番茄沙司：', '糯米', '火腿', '糖：', '槐花', '茅根', '熟核桃仁', '豆沙', '凉水：', '熟中粉（微波加热）', '麦芽糖：', '肋排', '甜杏仁', '绵白糖：',
            '榨菜', '青菜', '蜜薯', '油皮：糖', '番茄酱', '炒香花生', '长沙臭豆腐', '黄豆', '紫薯', '良姜', '黑豆', '香醋', '糯米粉', '高度白酒', '葱段', '红酒糟',
            '莲子', '芒果', '菊花', '红皮萝卜', '花生碎', '西红柿', '柠檬：', '燕麦片', '腌好的榨菜', '花生', '黄豆：', '蒜苔', '桂花糖', '馓子', '泡打粉：', '核桃',
            '泡打粉', '酵母粉', '花椒粉：', '莴笋', '清水：', '黄糖', '葱白', '青蒜', '麻油', '黑木耳', '臭豆腐', '陈醋：', '小磨香油', '油酥：油', '油辣子',
            '豆瓣酱', '干香菇', '丁香', '地瓜淀粉', '木薯粉', '玉米', '清水', '玉米油：', '中筋面粉', '干河粉', '红曲米（红皮）', '蒜苗：', '米醋：', '竹炭粉',
            '水磨糯米粉', '蜂蜜：', '新蔓越莓果', '料酒：', '辣椒面：', '椰丝', '红椒：', '胡萝卜碎', '鲜酱油', '红糖：', '紫芋', '大肠', '姜片：', '全麦粉', '蚝油：',
            '春笋片', '粳米粉', '老抽：', '芋头', '花生酱', '泡发黄豆', '酒糟', '红油：', '甜辣酱', '芝麻：', '青菜：', '水淀粉', '玫瑰花', '芹菜', '火锅料：',
            '香草', '味极鲜酱油', '油豆腐', '可乐', '十三香', '蒜蓉', '家乐海味点蘸鲜露', '白醋', '高汤', '美极鲜', '芝麻油', '辣椒：', '淀粉：', '啤酒', '白萝卜',
            '糖桂花', '米', '臊子', '白扣', '小木签：', '芝麻碎', '梅菜', '热水：', '白糖：', '核桃仁', '老豆腐', '蛏子', '玉米淀粉：', '河蚬', '姜段：',
            '香菇饺子馅', '胡萝卜', '脱皮绿豆', '老干妈风味豆豉', '生粉水：', '秀珍菇', '吐司', '绿尖椒', '黑胡椒粉', '蒜瓣', '黄豆面', '麦芽糖', '蒜', '红柿子椒',
            '红薯淀粉', '南瓜', '糯米饭', '黄豆粉', '玉桂皮', '地瓜粉', '自制猕猴桃干', '母子酱油', '红豆沙：', '河粉', '荞麦米', '蒜：', '水磨粘米粉', '黄酱', '烫面团',
            '肠粉预拌粉', '豆芽菜', '油菜', '鹹三蒸酒', '味精：', '白芝麻适量：', '白芷', '莲菜', '白醋：', '盐巴', '澄面', '自制叉烧', '生粉：', '玉米油', '小米椒',
            '葱末', '罐头红豆', '白胡椒', '椒盐', '油：', '枸杞', '香菜末', '蒜头油：', '老干妈豉油：', '扇贝', '榨菜末', '可口可乐', '高筋面粉', '米醋', '臭豆腐乳',
            '椰蓉馅：', '绿豆仁', '蔬菜油：', '生面', '姜黄粉', '泰椒：', '去皮豌豆', '黄豆芽', '酵母', '莲蓉馅', '啤酒：', '芥花油', '番茄沙司', '大蒜：', '碎芝士',
            '红烧老抽', '热水', '长茄子', '辣椒粉', '老姜', '酵母：', '老干妈酱', '芽菜：', '琼脂', '生抽酱油', '豌豆淀粉', '沸水', '蛋液：', '泡姜', '胡萝卜丁',
            '芝麻酱', '小米辣', '糖桂花：', '鲜红辣椒', '芫荽', '植物油：', '葱粒：', '菜籽油', '花椒面', '海米鲜味汁：', '高筋粉（防粘撒粉用）', '干红辣椒', '辣椒酱：',
            '面粉', '饮用水（分两次，详见步骤）', '色拉油：', '清水（白皮）', '沙姜', '萝卜', '尖椒：', '菠菜', '辣椒粉：', '生粉水', '冰糖：', '茄子', '菜叶子：', '毛笋：',
            '麻辣块', '黑麦粉', '蒜末', '香葱：', '干香菇：', '甜面酱', '芸豆', '米粉', '调味汁', '仙草粉', '郴州豆油', '春笋', '白芝麻', '油皮：温水', '叉烧酱',
            '柚子叶：', '姜葱', '干贝', '红葱头', '韭菜梗', '十三香粉', '高度酒', '什锦蔬菜', '水：', '秋葵', '木耳', '压板豆腐：', '地瓜粉：', '白砂糖：', '金针菇',
            '酵母粉：', '面粉：', '香辛料：', '紫苏', '黑枣泥', '砂糖', '春卷皮', '开水：', '蒜粒', '大料', '粉条', '大葱段', '小红尖椒', '绿豆', '花椒油', '辣椒酱',
            '香肠', '香葱碎', '糟卤汁', '小冰糖：', '冰水', '老陈醋', '中筋面粉（红皮）', '雪花梨', '文蛤', '菜芯', '干辣椒碎', '枣泥', '香菜', '草果', '黄瓜',
            '野山椒', '玉米淀粉', '小米面', '开洋：', '郫县豆瓣酱', '红薯粉', '小白菜', '蛋清', '碎米芽菜', '胡萝卜花片', '包菜干', '海带丝', '干红枣', '小茴香', '黍米',
            '冰糖粉：', '苏打粉', '姜母红糖：', '圆生菜', '手擀面', '青尖椒', '香辣酱', '糍粑', '自制辣酱', '草菇', '北豆腐', '烹调油：', '包菜', '米酒', '干辣椒段',
            '莲藕', '洋葱', '玉米面', '朝天椒', '香醋：', '特生粉', '清水（红皮）', '芹菜：', '牡蛎', '姜丝：', '油麦菜：', '油皮：面粉', '紫菜', '白菜', '芝麻酱：',
            '花蛤', '红椒', '花甲', '红萝卜', '红油辣椒', '海鲜酱油', '低筋面粉（油酥）', '米饭', '腰果', '糖桂花酱', '生姜', '红薯', '冰粉', '紫金酱', '肠粉',
            '蒜黄', '料包', '菜花', '螺蛳粉', '高筋粉', '豆豉', '芝麻红油', '红豆沙', '食用盐', '芝麻', '泡椒', '芋头：', '红曲米酒', '金不换：', '黑芝麻粉',
            '红烧酱油', '绿色蔬菜：', '内脂豆腐', '蔓越莓：', '干葱头', '青椒', '剁辣椒：', '麻酱', '花椒油：', '仔排', '椒盐：', '竹蔗', '泡发木耳', '熟芝麻',
            '花生油：', '豆干', '荠菜', '蒜末：', '紫薯粉：', '红豆', '红心地瓜', '泡发香菇', '孜然面', '味极鲜', '栀子', '中筋粉', '白胡椒粉：', '荸荠', '蒜块：',
            '辣椒段', '饴糖（水饴/麦芽糖）', '黑芝麻', '苦瓜', '细砂糖', '圆橄榄', '紫草：', '油麦菜', '线豆瓣酱', '醋', '菠萝', '豆腐皮', '麦芽糖水', '圆白菜', '藕',
            '蒜片：', '香叶：', '油皮：玉米油', '油酥：面粉', '土豆', '小青尖椒', '饺子皮', '海参', '腐乳汤', '火锅料', '玫瑰酱', '桂花', '剁椒酱', '黄酒', '柠檬',
            '胡萝卜：', '白酒', '豆腐', '红椒圈', '圆糯米', '蒜头', '小火葱', '南瓜蓉', '白酒：', '黑米', '银耳', '红油', '红小米辣', '高度白酒：', '老汤', '香葱',
            '小芋仔', '蔓越莓干', '蛋白', '干酵母：', '花雕酒', '老干妈油辣椒：', '熟黄豆粉：', '海虹', '鲜燕皮', '大蒜 ', '小油菜', '酱油：', '绿叶蔬菜', '大米粉',
            '黄豆酱', '净冬笋', '蒜苗', '熟白芝麻：', '红枣', '柿饼', '小青菜', '砂仁粉', '海鲜酱', '自制剁椒', '胆水：', '土笋', '瓜子仁', '西兰花', '高汤：',
            '皮蛋', '芽菜', '普通面粉', '干黄花菜', '干酵母']  # 素类
    peiliao = ['姜粒', '白砂糖', '糖霜', '香叶', '葱', '老干妈辣椒油', '辣椒油', '蚝油', '酱油', '温水', '胡椒粉', '大蒜子', '蜂蜜', '陈醋', '酒', '油',
               '椰蓉', '葱花', '香油', '水', '植物油', '糖', '红糖', '老抽', '糖粉', '姜片', '大蒜', '盐', '花生油', '冰糖', '食用油', '姜丝', '尖椒',
               '开水', '淀粉', '色拉油', '姜', '辣椒', '生抽', '橄榄油', '沙拉酱', '绵白糖', '小苏打', '大葱', '白糖', '小葱', '花椒粉', '生粉',
               '八角']  # 配料
    Hun = 0
    Su = 0
    PeiLiao = 0
    # if len(sys.argv) > 1:
    #     material = sys.argv[1].split('，')
    material = '面条，猪瘦肉，猪肝，虾仁，油豆腐，小青菜，沙茶酱，花生酱，番茄酱，盐，糖，料酒，胡椒粉，淀粉，葱，姜，蒜，鸡精，骨头汤'.split('，')




    # 对每条数据的每种原料进行计数
    for i in material:
        if i in row:
            Hun = Hun + 1
            continue
        elif i in vege:
            Su = Su + 1
            continue
        elif i in peiliao:
            PeiLiao = PeiLiao + 1

    items=dict()
    items.setdefault('Hun',Hun)
    items.setdefault('Su', Su)
    items.setdefault('PeiLiao', PeiLiao)

    price=pedict_price(items)
    print(type(price))
    print(price[0])